app/Views/dashboard.php

SELECT *
FROM `likes`
WHERE `userID` = '6'
AND `postID` = '1'
 LIMIT 1
---
                                $session = session();
                                $userID = $session->get('id');
                                $likeModel = new \App\Models\LikeModel();
                                $like = $likeModel->
                                where('userID', $userID)
                                ->where('postID', $post['postID'])
                                ->first();